content-org/why-lisp.org
:PROPERTIES:
:EXPORT_FILE_NAME: why-lisp
:END:
#+hugo_base_dir: ../
#+title: Why Lisp?
#+filetags: emacs javascript lisp
#+date: [2022-09-28 Wed]
#+author: Mekael Turner

* Writing Lisp Code is Easy
- However good Lisp programming is hard according to Richard P. Gabriel.
* Lisp is extremely hackable
- It's easy to create a Lisp Language
- It's Easy to Make a Lisp Language Domain Specific
- Writing a parser and compiler for Lisp is way claner than other languages
* Emacs is configured with Lisp
* Lisp Helps Me with My Programmatic Thinking
- Once you know Lisp you think of programming in a very different way.
* Lisp has heavy ties to Functional Programming
- My interested in mathematics has motivated my interest in functional programming.
- A lot of functional programming ideas implemented in other programming languages started in Lisp.
- A lot of academic computer science work uses Lisp.
* Common Lisp's Object-Oriented System is Great
* Development of programs in Lisp advance faster then in other languages
- Its easy to build a prototype of an idea in Lisp.
- Many programms have started as Emacs packages.

- The discretionary exportable functionality entrusted to the individual Lisp programmer is more than an order of magnitude greater than that to be found within Pascal enterprises. - Alan J. Perlis
- Development of programs in Lisp proceeds somewhere between 1000 and 5000 times faster then development in "modern" or "improved" computer languages. - Douglas Lenat Lex Fridman Podcast
- You can hire fewer people, by 80%, by developing in Lisp. - Eric Normand
- You don't need a lot of dependencies to get your project off in Lisp
